/*                         LAB-7
		Лабораторная работа по теме
		  "Числа сплавающей запятой"

	 */
#include<stdio.h>
#include<dos.h>
#include<iostream.h>
#include <conio.h>
#include <float.h>

void main(void)
{ int aa;
// Операции с плавающей запятой на уровне Си
  float bb,ad;
  aa=1; bb=5.0;ad=3.1;
  bb=aa;
cout<<"\n Ci  "<<bb;
// cin>>bb;
getch();

// Операции с плавающей запятой на уровне Ассемблера
asm {   finit
	fld ad
	fld bb
	fadd
	fstp bb
}
cout<<"   Acc  "<<bb;
getch();

  return;
// Задания
// 1 Выполните операции над числами с ПЗ на уровне Си
// 2 Напишите программу на Асс (см пример): Введите в диалоге три числа,
// загрузите их в регистры FPU, просуммируйте, выведите результат
// Проследите работу FPU в TD. Как используются регистры FPU ?
// 3 Получите в FPU нечисло (NaN), покажите его в TD. Вызовите
// прерывание по этому особому случаю.
// 4 Напишите на Асс выражение для чисел с ПЗ: x=x/y. Проверьте в TD
  }
